{
    "habilidades": {
        "01":{
            "nome": "Html, cs e javascript",
            "descricao": "HTHTML, CSS e JavaScript são de fato as três tecnologias fundamentais no desenvolvimento web, desempenhando papéis cruciais na criação e na interatividade das páginas da web. JavaScript é, sem dúvida, a tecnologia que mais amo",
            "imagem_url": "../public/icons-habilidades/html-css-javascript.jpg"
        }
        ,
        "02":{
            "nome": "Veu.js",
            "descricao": "Minha jornada com Vue.js já ultrapassa dois anos e, simplesmente, adoro essa tecnologia. Não há nada igual a ela. Embora no futuro eu tenha interesse em explorar mais o React e o Angular, minha experiência com Vue.js tem sido excepcional. <br> Por outro lado, após trabalhar intensivamente com o Nuxt.js 2, acabei abandonando-o devido às atualizações que me deixaram insatisfeito, e sigo minha jornada apenas com Vue.js.",
            "imagem_url": "../public/icons-habilidades/VUE.jpG"
        }
        ,
        "03":{
            "nome": "Regex(Expressões regulares)",
            "descricao": "Uso expressões regulares (regex) com frequência para realizar validações de entrada ou criar regras personalizadas para inputs. Sempre que me deparo com desafios desse tipo, as expressões regulares estão lá para me salvar.",
            "imagem_url": "../public/icons-habilidades/regex.png"
        }
        ,
        "04":{
            "nome": "Php e Mysql",
            "descricao": "PHP e MySQL são o meu kit de ferramentas para o backend. Eu os utilizei bastante para praticar as requisições HTTP. Na época, eu estava enfrentando incertezas sobre como prosseguir, então decidi criar meu próprio servidor PHP com banco de dados para armazenar informações e integrá-lo ao meu site do lado do cliente",
            "imagem_url": "../public/icons-habilidades/php-mysql.jpg"
        }
        ,
        "05":{
            "nome": "Git",
            "descricao": "Estou atualmente aprendendo a usar o Git para o versionamento de código e estou progredindo bem.",
            "imagem_url": "../public/icons-habilidades/git.png"
        }
        ,
        "06":{
            "nome": "Extras",
            "descricao": "*Json *Scss",
            "imagem_url": "../public/icons-habilidades/photosop-ilustrato-aftert.jpg"
        }
    },

    "em breve": {
        "01":{
            "nome": "Photoshop, adobe ilustrato, e after effects",
            "descricao": "Adobe Illustrator, Photoshop e After Effects são as cerejas do bolo do meu site. São tecnologias que utilizo para melhorar significativamente o aspecto visual do meu site. Embora o CSS seja eficaz, ele pode ter limitações em termos de recursos criativos. Portanto, pensei: por que não combinar essas ferramentas para alcançar resultados visuais ainda mais impressionantes?",
            "imagem": "../public/icons-habilidades/photosop-ilustrato-aftert.jpg"
        },

        "02":{
            "nome": "Laravel",
            "descricao": "",
            "imagem": ""
        }
    }   
    
}
